package com.go.cqh.goodprojects.entry;

import java.io.Serializable;
import java.util.List;

/**
 * Created by caoqianghui on 2017/1/22.
 */

public class HistoryBean implements Serializable {

    /**
     * error_code : 0
     * reason : success
     * result : [{"date":"589年01月22日","day":"1/22","e_id":"1005","title":"陈朝灭亡"},{"date":"1294年01月22日","day":"1/22","e_id":"1006","title":"忽必烈逝世"},{"date":"1440年01月22日","day":"1/22","e_id":"1007","title":"伊凡三世·瓦西里耶维奇出生"},{"date":"1561年01月22日","day":"1/22","e_id":"1008","title":"提出\u201c知识就是力量\u201d第一人弗兰西斯·培根诞辰"},{"date":"1729年01月22日","day":"1/22","e_id":"1009","title":"德国剧作家戈特霍尔德·埃弗赖姆·莱辛出生"},{"date":"1788年01月22日","day":"1/22","e_id":"1010","title":"伟大的浪漫主义诗人拜伦诞辰"},{"date":"1811年01月22日","day":"1/22","e_id":"1011","title":"中国清代数学家李善兰出生"},{"date":"1865年01月22日","day":"1/22","e_id":"1012","title":"德国物理学家弗里德里希·帕邢出生"},{"date":"1878年01月22日","day":"1/22","e_id":"1013","title":"祖鲁在伊山得瓦纳战役中击败英国军队"},{"date":"1895年01月22日","day":"1/22","e_id":"1014","title":"中国社会学家、社会调查学家李景汉出生"},{"date":"1901年01月22日","day":"1/22","e_id":"1015","title":"英国维多利亚女王逝世"},{"date":"1905年01月22日","day":"1/22","e_id":"1016","title":"彼得堡的\u201c流血星期日\u201d"},{"date":"1908年01月22日","day":"1/22","e_id":"1017","title":"苏联物理学家列夫·朗道出生"},{"date":"1909年01月22日","day":"1/22","e_id":"1018","title":"中国出版家黄洛峰出生"},{"date":"1916年01月22日","day":"1/22","e_id":"1019","title":"《民国日报》创刊"},{"date":"1919年01月22日","day":"1/22","e_id":"1020","title":"瑞典画家卡尔·拉森逝世"},{"date":"1922年01月22日","day":"1/22","e_id":"1021","title":"美国科学计量学奠基人和情报科学创始人之一普赖斯出生"},{"date":"1924年01月22日","day":"1/22","e_id":"1022","title":"英国工党首次执政"},{"date":"1928年01月22日","day":"1/22","e_id":"1023","title":"湘南起义"},{"date":"1928年01月22日","day":"1/22","e_id":"1024","title":"方志敏发动领导农民武装起义"},{"date":"1942年01月22日","day":"1/22","e_id":"1025","title":"女作家萧红病逝"},{"date":"1944年01月22日","day":"1/22","e_id":"1026","title":"二战期间盟军在安齐奥登陆"},{"date":"1946年01月22日","day":"1/22","e_id":"1027","title":"廖承志获释"},{"date":"1947年01月22日","day":"1/22","e_id":"1028","title":"上海武定路西摩路大火奇案"},{"date":"1948年01月22日","day":"1/22","e_id":"1029","title":"首批日本赔偿物资到达上海"},{"date":"1949年01月22日","day":"1/22","e_id":"1030","title":"李宗仁接受中共谈判条件"},{"date":"1949年01月22日","day":"1/22","e_id":"1031","title":"中国共产党接管北平"},{"date":"1951年01月22日","day":"1/22","e_id":"1032","title":"烫发的发明者美国人内斯勒逝世"},{"date":"1963年01月22日","day":"1/22","e_id":"1033","title":"法国联邦德国合作条约签订"},{"date":"1963年01月22日","day":"1/22","e_id":"1034","title":"甲壳虫乐队开始风靡英国"},{"date":"1964年01月22日","day":"1/22","e_id":"1035","title":"国防部授予解放军某部六连以\u201c硬骨头六连\u201d光荣称号"},{"date":"1968年01月22日","day":"1/22","e_id":"1036","title":"中央电视台主持人王小丫出生"},{"date":"1972年01月22日","day":"1/22","e_id":"1037","title":"英国、爱尔兰、丹麦和挪威加入欧洲经济共同体"},{"date":"1973年01月22日","day":"1/22","e_id":"1038","title":"美国第36任总统林登·约翰逊去世，终年64岁"},{"date":"1980年01月22日","day":"1/22","e_id":"1039","title":"苏联持不同政见者萨哈罗夫被流放到高尔基市"},{"date":"1987年01月22日","day":"1/22","e_id":"1040","title":"中共中央发出《把农村改革引向深入》的通知"},{"date":"1993年01月22日","day":"1/22","e_id":"1041","title":"邓小平说：上海工人阶级长期以来一直是中国工人阶级的带头羊"},{"date":"1996年01月22日","day":"1/22","e_id":"1042","title":"全国宣传部长会议在北京举行"},{"date":"1997年01月22日","day":"1/22","e_id":"1043","title":"奥尔布赖特出任美国首位女国务卿"},{"date":"1998年01月22日","day":"1/22","e_id":"1044","title":"美巴首脑会谈\u2014\u2014讨论挽救中东和平进程的问题"},{"date":"2003年01月22日","day":"1/22","e_id":"1045","title":"公安部对全国公安系统提出了\u201c五条禁令\u201d"},{"date":"2004年01月22日","day":"1/22","e_id":"1046","title":"国务院发布第五批国家重点风景名胜区名单，共26处"},{"date":"2005年01月22日","day":"1/22","e_id":"1047","title":"香港和澳门的基本法起草委员萧蔚云逝世"},{"date":"2012年01月22日","day":"1/22","e_id":"1048","title":"《熊出没》首播"}]
     */

    public int error_code;
    public String reason;
    public List<ResultBean> result;

    public static class ResultBean  implements Serializable  {
        /**
         * date : 589年01月22日
         * day : 1/22
         * e_id : 1005
         * title : 陈朝灭亡
         */

        public String date;
        public String day;
        public String e_id;
        public String title;
    }
}
